abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // V_bat_mV = bat_raw * 1200 * 2 / vref_raw (for 100k/100k divider)
  uint32_t v_bat_mv = ((uint32_t)bat_raw * 2400) / vref_raw;

  DEBUG_PRINT("[BAT] %lumV\r\n", (unsigned long)v_bat_mv);

  // Map 3000mV-4200mV to 0-100%
  if (v_bat_mv >= 4200) return 100;
  if (v_bat_mv <= 3000) return 0;
  return (uint8_t)((v_bat_mv - 3000) * 100 / 1200);
}

/* ========== Auto-Generate Tank ID ========== */
uint16_t generate_new_tank_id(void) {
  // Generate a pseudo-random 16-bit ID using current millis
  // This ensures each reset produces a different ID
  uint32_t seed = millis();

  // Simple pseudo-random algorithm using bit manipulation
  seed = (seed ^ (seed << 13));
  seed = (seed ^ (seed >> 17));
  seed = (seed ^ (seed << 5));

  // Ensure ID is never 0x0000 (reserved for invalid)
  uint16_t new_id = (uint16_t)(seed & 0xFFFF);
  if (new_id == 0x0000) {
    new_id = 0x0001;
  }

  return new_id;
}

/* ========== Protocol Checksum (CRC-8) ========== */
uint8_t calculate_checksum(uint8_t *data, uint8_t length) {
  uint8_t crc = 0x00;
  for (uint8_t i = 0; i < length - 1; i++) {
    crc ^= data[i];
    for (uint8_t j = 0; j < 8; j++) {
      if (crc & 0x80)
        crc = (crc << 1) ^ 0x07; // Polynomial 0x07
      else
        crc <<= 1;
    }
  }
  return crc;
}

void run_pairing(void) {
  nrf24_init();
  Delay_Ms(100);

  uint16_t new_id = generate_new_tank_id();
  DEBUG_PRINT("\r\n[PAIR] NewID:0x%04X\r\n", new_id);

  // DO NOT save pairing_status yet - wait for controller ACK first
  uint8_t packet[32] = {0};
  packet[0] = 0xAA;
  packet[1] = 0x55;
  packet[2] = 0x01; // PKT_TYPE_PAIRING_REQ
  packet[3] = 32;
  packet[4] = (new_id & 0xFF);
  packet[5] = (new_id >> 8);
  packet[6] = read_tank_level();    // Level at index 6
  DEBUG_PRINT("[PAIR] Lvl:%d Reading bat...\r\n", packet[6]);
  packet[7] = read_battery_level(); // Battery at index 7
  DEBUG_PRINT("[PAIR] Bat:%d\r\n", packet[7]);
  packet[8] = 0x10;                 // Version at index 8
  packet[31] = calculate_checksum(packet, 32);

  DEBUG_PRINT("[PAIR] Pkt: ");
  for (int k = 0; k < 8; k++)
    DEBUG_PRINT("%02X ", packet[k]);
  DEBUG_PRINT("CRC:%02X\r\n", packet[31]);

  DEBUG_PRINT("[PAIR] Bcast %dmin bursts:%d ack:%dms\r\n",
              PAIRING_TIME_MINS,
              PAIRING_BURST_COUNT, PAIRING_ACK_WAIT_MS);

  bool paired = false;
  uint8_t ack_status = PAIRING_ACK_STATUS_TIMEOUT;

  for (int i = 0; i < PAIRING_BURST_COUNT && !paired; i++) {
    // LED blink pattern
    if ((i % 10) < 5)
      GPIO_ResetBits(GPIOD, LED_PIN);
    else
      GPIO_SetBits(GPIOD, LED_PIN);

    // Log every 20th burst so user can see progress
    if (i % 20 == 0) {
      DEBUG_PRINT("[PAIR] #%d/%d S:0x%02X\r\n", i,
                  PAIRING_BURST_COUNT, nrf24_get_status());
    }

    // 1. Send pairing request
    nrf24_power_up_tx();
    nrf24_set_tx_addr(PAIRING_ADDR);
    nrf24_send(packet, 32);

    // 2. Flush RX FIFO + switch to RX to listen for controller ACK
    nrf24_flush_rx();
    nrf24_power_up_rx();

    // 3. Wait for ACK from controller
    uint32_t start = millis();
    while ((millis() - start) < PAIRING_ACK_WAIT_MS) {
      if (nrf24_available()) {
        uint8_t rx_buf[32];
        nrf24_read(rx_buf, 32);

        DEBUG_PRINT("[PAIR] RX: S=%02X%02X T=%02X\r\n", rx_buf[0],
                    rx_buf[1], rx_buf[2]);

        // Check normal sync: 0xAA 0x55 + type 0x07 (PAIRING_RESP)
        if (rx_buf[0] == 0xAA && rx_buf[1] == 0x55 &&
            rx_buf[2] == PKT_TYPE_PAIRING_RESP) {
          uint8_t calc_crc = calculate_checksum(rx_buf, 32);
          uint16_t resp_id =
              (uint16_t)rx_buf[4] | ((uint16_t)rx_buf[5] << 8);

          DEBUG_PRINT("[PAIR] NSync RID:0x%04X MY:0x%04X "
                      "CC:%02X PC:%02X\r\n",
                      resp_id, new_id, calc_crc, rx_buf[31]);

          if (calc_crc == rx_buf[31] && resp_id == new_id) {
            ack_status = rx_buf[11]; // Status at offset 11
            DEBUG_PRINT("[PAIR] ACK st:%d\r\n", ack_status);

            if (ack_status == PAIRING_ACK_STATUS_PAIRED) {
              // NOW save - controller confirmed pairing is done
              g_settings.tank_id = new_id;
              g_settings.pairing_status = 1;
              flash_save_settings();
              paired = true;
              DEBUG_PRINT("[PAIR] OK! ID:0x%04X\r\n", new_id);
            }
            break;
          } else {
            DEBUG_PRINT("[PAIR] CRC/ID mismatch\r\n");
          }
        }

        // Check bit-inverted sync (NRF phase alignment workaround)
        {
          uint8_t inv[32];
          for (int j = 0; j < 32; j++)
            inv[j] = ~rx_buf[j];

          if (inv[0] == 0xAA && inv[1] == 0x55 &&
              inv[2] == PKT_TYPE_PAIRING_RESP) {
            uint8_t calc_crc = calculate_checksum(inv, 32);
            uint16_t resp_id =
                (uint16_t)inv[4] | ((uint16_t)inv[5] << 8);

            DEBUG_PRINT("[PAIR] InvSync RID:0x%04X MY:0x%04X "
                        "CC:%02X PC:%02X\r\n",
                        resp_id, new_id, calc_crc, inv[31]);

            if (calc_crc == inv[31] && resp_id == new_id) {
              ack_status = inv[11];
              DEBUG_PRINT("[PAIR] ACK(Inv) st:%d\r\n",
                          ack_status);

              if (ack_status == PAIRING_ACK_STATUS_PAIRED) {
                g_settings.tank_id = new_id;
                g_settings.pairing_status = 1;
                flash_save_settings();
                paired = true;
                DEBUG_PRINT("[PAIR] OK(Inv)! ID:0x%04X\r\n",
                            new_id);
              }
              break;
            } else {
              DEBUG_PRINT("[PAIR] Inv CRC/ID mismatch\r\n");
            }
          }
        }
      }
      Delay_Ms(1);
    }
  }

  GPIO_SetBits(GPIOD, LED_PIN); // LED OFF
  nrf24_power_down();

  if (paired) {
    // Success feedback: Fast 5x blink
    for (int i = 0; i < 5; i++) {
      GPIO_ResetBits(GPIOD, LED_PIN);
      Delay_Ms(100);
      GPIO_SetBits(GPIOD, LED_PIN);
      Delay_Ms(100);
    }
    DEBUG_PRINT("[PAIR] DONE\r\n");
  } else {
    // Failed: ensure NOT marked as paired
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    flash_save_settings();

    // Failure feedback: Slow 3x blink
    for (int i = 0; i < 3; i++) {
      GPIO_ResetBits(GPIOD, LED_PIN);
      Delay_Ms(500);
      GPIO_SetBits(GPIOD, LED_PIN);
      Delay_Ms(500);
    }
    DEBUG_PRINT("[PAIR] FAIL after %d tries\r\n",
                PAIRING_BURST_COUNT);
  }
}

/* ========== Main Loop ========== */
int main(void) {
  SystemCoreClockUpdate();
  Delay_Init();
  USART_Printf_Init(115200);

  DEBUG_PRINT("\r\n=== TANK BOOT ===\r\n");
  DEBUG_PRINT("CH32V003 @ %luHz\r\n",
              (unsigned long)SystemCoreClock);

  timer_init();
  gpio_init();
  adc_init();
  pwr_sleep_init();

