abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // SAFETY: Delay at boot to allow WCH-Link to connect before MCU sleeps.
  // This is the most reliable way to prevent "Lockout" during development.
  DEBUG_PRINT("[SYS] SafeDelay %dms.. ",
              BOOT_SAFETY_DELAY_MS);
  Delay_Ms(BOOT_SAFETY_DELAY_MS);
  DEBUG_PRINT("OK\r\n");

  __enable_irq();

  DEBUG_PRINT("Init Radio...\r\n");
  nrf24_init();
  nrf24_power_down(); // Start in low power mode

  // Load settings from Flash
  flash_read_settings();

  if (g_settings.pairing_status == 1) {
    DEBUG_PRINT("[SYS] Paired ID:0x%04X\r\n",
                g_settings.tank_id);
    nrf24_set_tx_addr(PAIRING_ADDR); // Ensure address is set
  } else {
    DEBUG_PRINT(
        "[SYS] NOT PAIRED. Hold button to pair\r\n");
  }

  // Boot UI: Triple blink (500ms ON, 500ms OFF)
  for (int i = 0; i < 3; i++) {
    GPIO_ResetBits(GPIOD, LED_PIN); // ON
    Delay_Ms(500);
    GPIO_SetBits(GPIOD, LED_PIN); // OFF
    Delay_Ms(500);
  }
  GPIO_SetBits(GPIOD, LED_PIN); // Extra safety: ensure LED is OFF

  DEBUG_PRINT("[SYS] Idle (Hold btn=pair)\r\n");

  uint32_t button_press_start = 0;
  bool pairing_triggered = false;
  uint16_t sleep_cycle_count = 0;

  // Trackers (Must be reset on pairing)
  uint32_t seq_num = 0;
  uint8_t last_sent_level = 0xFF;
  uint8_t filtered_level = 0;
  uint8_t stable_counter = 0;
  bool first_reading_done = false;
  uint8_t current_battery = 0;

  while (1) {
    // 1. Button Handling
    if (GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0) {
      if (button_press_start == 0) {
        button_press_start = millis();
        DEBUG_PRINT("[SYSTEM] Button Pressed\r\n");
      }

      uint32_t held_ms = millis() - button_press_start;

      // --- FACTORY RESET (Long Press >= 5s) ---
      if (!pairing_triggered && held_ms > RESET_PRESS_TIME_MS) {
        DEBUG_PRINT(
            "[SYS] FACTORY RESET\r\n");
        pairing_triggered = true;

        // Sync Unpair with Receiver before reset
        if (g_settings.pairing_status == 1 && g_settings.tank_id != 0) {
          DEBUG_PRINT(
              "Sending UNPAIR before reset\r\n");
          uint8_t unpair_pkt[32] = {0};
          unpair_pkt[0] = 0xAA;
          unpair_pkt[1] = 0x55;
          unpair_pkt[2] = 0x06; // PKT_TYPE_UNPAIR
          unpair_pkt[3] = 32;
          unpair_pkt[4] = (uint8_t)(g_settings.tank_id & 0xFF);
          unpair_pkt[5] = (uint8_t)(g_settings.tank_id >> 8);
          unpair_pkt[31] = calculate_checksum(unpair_pkt, 32);

          nrf24_power_up_tx();
          nrf24_set_tx_addr(PAIRING_ADDR);
          for (int i = 0; i < 20; i++) {
            nrf24_send(unpair_pkt, 32);
            Delay_Ms(30);
          }
          nrf24_power_down();
        }

        g_settings.tank_id = 0;
        g_settings.pairing_status = 0;
        flash_save_settings();

        // Reset local trackers
        seq_num = 0;
        last_sent_level = 0xFF;
        first_reading_done = false;

        run_pairing(); // Enters pairing mode broadcast for 30s
      }
      Delay_Ms(10);
      continue; // Don't sleep while button is held
    } else {
      // Button Released
      if (button_press_start != 0) {
        uint32_t held_ms = millis() - button_press_start;

        if (!pairing_triggered && held_ms > 10 &&
            held_ms < RESET_PRESS_TIME_MS) {
          if (g_settings.pairing_status == 0) {
            // --- NOT PAIRED: Short click starts pairing ---
            DEBUG_PRINT("[SYS] Click -> Pair\r\n");
            run_pairing();
          } else {
            // --- PAIRED: Short click resets MCU ---
            DEBUG_PRINT("[SYS] Click -> Reset\r\n");
            Delay_Ms(100);
            NVIC->SCTLR |= (1 << 31); // SYSRESETREQ
          }
        }

        button_press_start = 0;
        pairing_triggered = false;
      }
    }

    // 2. Data Logic (Only if paired)
    if (g_settings.pairing_status == 1) {
      uint8_t raw_level = read_tank_level();

      // --- Water Ripple Filter (Stable Level) ---
      if (!first_reading_done) {
        // First time after boot: Bypass filter to show instant result
        filtered_level = raw_level;
        first_reading_done = true;
        stable_counter = 0;
        DEBUG_PRINT("[SYSTEM] Init Level: %d%%\r\n",
                    filtered_level);
      } else {
        // In Sleep Mode, we want faster updates.
        // If level changed, we only wait 1 cycle (approx 10s)
        if (raw_level == filtered_level) {
          stable_counter = 0; // Already stable
        } else {
          stable_counter++;
          if (stable_counter >= 1) { // INSTANT UPDATE (1 cycle only)
            filtered_level = raw_level;
            stable_counter = 0;
            DEBUG_PRINT("[SYS] LvlChg: %d%%\r\n",
                        filtered_level);
          }
        }
      }

      uint8_t current_level = filtered_level;
      bool level_changed = (current_level != last_sent_level);
      bool heartbeat_due = (sleep_cycle_count >= HEARTBEAT_CYCLES);

      // --- Battery Internal Logic ---
      if (last_sent_level == 0xFF || heartbeat_due) {
        current_battery = read_battery_level();
        DEBUG_PRINT("[BAT] Battery level: %d%%\r\n", current_battery);
        Delay_Ms(100); // stabilize battery reading
      }

      // Send if: First time OR Level changed OR 4 hours passed
      if (last_sent_level == 0xFF || level_changed || heartbeat_due) {
        uint8_t packet[32];
        for (int i = 0; i < 32; i++)
          packet[i] = 0; // Absolute Zero-Fill

        packet[0] = 0xAA;
        packet[1] = 0x55;
        packet[2] = 0x02;
        packet[3] = 32;
        packet[4] = (uint8_t)(g_settings.tank_id & 0xFF);
        packet[5] = (uint8_t)(g_settings.tank_id >> 8);
        packet[6] = current_level;
        packet[7] = (uint8_t)current_battery;

        packet[8] = 0;
        if (current_battery <= BATTERY_LOW_THRESHOLD)
          packet[8] |= 0x01; // Low Battery Flag

        packet[9] = g_probe_fault; // Probe Fault status (1 or 0)

        packet[12] = (uint8_t)(seq_num & 0xFF);
        packet[13] = (uint8_t)((seq_num >> 8) & 0xFF);
        packet[14] = (uint8_t)((seq_num >> 16) & 0xFF);
        packet[15] = (uint8_t)((seq_num >> 24) & 0xFF);
        packet[31] = calculate_checksum(packet, 32);

        DEBUG_PRINT("[TX] %s Seq:%lu L:%d%% B:%d%% F:%d\r\n",
                    level_changed ? "CHG" : "HB",
                    (unsigned long)seq_num, current_level, current_battery,
                    g_probe_fault);

        // --- POWERFUL RADIO RE-INIT ---
        nrf24_init(); // Reset state
        nrf24_power_up_tx();
        nrf24_set_tx_addr(PAIRING_ADDR);
        Delay_Ms(200);

        // Burst send 3 times (ACK retry to be added later)
        for (int b = 0; b < 3; b++) {
          nrf24_send(packet, 32);
          Delay_Ms(20);
        }
        DEBUG_PRINT("[TX] Sent 3x\r\n");

        Delay_Ms(50);

        last_sent_level = current_level;
        sleep_cycle_count = 0; // Reset heartbeat counter
        seq_num++;

        nrf24_power_down();

        // Quick LED blink to confirm TX
        GPIO_ResetBits(GPIOD, LED_PIN);
        Delay_Ms(100);
        GPIO_SetBits(GPIOD, LED_PIN);
      }
    } else {
      DEBUG_PRINT("[SYS] Not paired\r\n");
      Delay_Ms(100);
    }

    // 3. Enter Deep Sleep
    if (g_settings.pairing_status == 1) {
      DEBUG_PRINT("[SYS] Sleep\r\n");
      DEBUG_PRINT("----------\r\n");
    }
    enter_deep_sleep();
    sleep_cycle_count++; // Increment cycles on each AWU wake
  }
}
